name: "densenet_trt"
platform: "tensorrt_plan"
max_batch_size: 0

input [
  {
    name: "data_0"  
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ] 
  }
]

output [
  {
    name: "fc6_1" 
    data_type: TYPE_FP32
    dims: [ 1,1000,1,1 ]  
  }
]

instance_group [{ kind: KIND_GPU }]